# DataFrame 생성

#### pd.DataFrame(data=None,index: Union[Collection, NoneType] = None, columns: Union[Collection, NoneType] = None,  dtype: Union[str, numpy.dtype, ForwardRef('ExtensionDtype'), NoneType] = None,   copy: bool = False)

## 딕셔너리로 생성하기

### index 없이 생성

In [ ]:
pd.DataFrame?

In [2]:
import pandas as pd

In [135]:
friend_dict_list = [
    {
        "name": "John",
        "age": 25,
        "job": "student",
    },
    {
        "name": "Nate",
        "age": 30,
        "job": "teacher",
    },
    {
        "name": "Jenny",
        "age": 30,
        "job": "developer",
    },
]

friend_df = pd.DataFrame(friend_dict_list)
friend_df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [21]:
# dict를  Dataframe 으로 변경

dict = {"국어": [15, 25, 35], "영어": [45, 55, 65], "수학": [75, 85, 95]}
student_df = pd.DataFrame(dict)
student_df

   국어  영어  수학
0  15  45  75
1  25  55  85
2  35  65  95

### index 사용

In [24]:
person_df = pd.DataFrame(friend_dict_list, index=["f1","f2","f3"])
person_df

     name  age        job
f1   John   25    student
f2   Nate   30    teacher
f3  Jenny   30  developer

In [23]:
month_df = pd.DataFrame(dict, index=["1월", "2월", "3월"])
month_df

    국어  영어  수학
1월  15  45  75
2월  25  55  85
3월  35  65  95

## 이차원 리스트

In [25]:
list = [[1, 2, 3, 4, 5], [6, 7, 8, 9, 10]]
two_df = pd.DataFrame(list,
                  index=["내용1", "내용2"],
                  columns=["c1", "c2", "c3", "c4", "c5"])
two_df

     c1  c2  c3  c4  c5
내용1   1   2   3   4   5
내용2   6   7   8   9  10

## csv 파일

In [12]:
df = pd.read_csv("../resources/sample1.csv")
df

    1   2   3
0   4   5   6
1   7   8   9
2  10  11  12
3  13  14  15
4  16  17  18

In [14]:
# 첫 번째 행이 컬럼명으로 변경되는 것 방지

df = pd.read_csv("../resources/sample1.csv", header=None)
df

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15
5  16  17  18

In [16]:
# 컬럼명 주기

df = pd.read_csv("../resources/sample1.csv", header=None, names=["c1", "c2", "c3"])
df

   c1  c2  c3
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15
5  16  17  18

In [17]:
# csv 구분자가 , 가 아닌 경우

df = pd.read_csv("../resources/sample2.csv", header=None, delimiter="|",encoding="utf-8")
df

     0    1                    2   3
0   번호   이름                 가입일시  나이
1    1  김정수  2017-01-19 11:30:00  25
2    2  박민구  2017-02-07 10:22:00  35
3    3  정순미  2017-01-22 09:10:00  33
4    4  김정현  2017-02-22 14:09:00  45
5    5  홍미진  2017-04-01 18:00:00  17
6    6  김순철  2017-05-14 22:33:07  22
7    7  이동철  2017-03-01 23:44:45  27
8    8  박지숙  2017-01-11 06:04:18  30
9    9  김은미  2017-02-08 07:44:33  51
10  10  장혁철  2017-12-01 13:01:11  16

In [19]:
# csv 파일의 첫번째 컬럼을 인덱스로 사용하기

df = pd.read_csv("../resources/sample2.csv",index_col=0,delimiter="|")
df

     이름                 가입일시  나이
번호
1   김정수  2017-01-19 11:30:00  25
2   박민구  2017-02-07 10:22:00  35
3   정순미  2017-01-22 09:10:00  33
4   김정현  2017-02-22 14:09:00  45
5   홍미진  2017-04-01 18:00:00  17
6   김순철  2017-05-14 22:33:07  22
7   이동철  2017-03-01 23:44:45  27
8   박지숙  2017-01-11 06:04:18  30
9   김은미  2017-02-08 07:44:33  51
10  장혁철  2017-12-01 13:01:11  16

## excel 파일

In [79]:
# 가져올 데이터가 큰 경우 전체를 가져와서 출력하지 않고 기본적인 부분만 확인

excel_df = pd.read_excel("../resources/train.xlsx")
excel_df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [80]:
# 엑셀 데이터 가져오기
# pandas에서 2003버전은 xlrd python module 사용
#            2007+ 버전은 xlrd, openpyxl 가능

sample_df = pd.read_excel("../resources/sample.xlsx")
sample_df

   Sap Co.        대리점 영업사원       전월       금월  TEAM  총 판매수량
0   KI1316    경기수원대리점  이기정  1720000  2952000     1     123
1   KI1451    충청홍성대리점  정미진  4080000  2706000     2     220
2   KI1534    경기화성대리점  경인선   600000  2214000     1     320
3   KI1636    강원속초대리점  이동권  3720000  2870000     3     110
4   KI1735    경기안양대리점  강준석  4800000  2296000     1     134
5   KI1875   제주제주시대리점  민경수  3420000  2346000     4     210
6   KI1917    경기광주대리점  김진혜  1292000  1518000     1     110
7   KI2032    경기평택대리점  고유정  2736000  2139000     2      90
8   KI2153   경기의정부대리점  김은향  1368000  2484000     1     183
9   KI2214    경기성남대리점  이준수  1976000  1518000     3      73
10  KI2313  제주서귀포시대리점  온지수   152000   945000     1      52
11  KI2433    경기계양대리점  이희영  1833000  1404000     1     110
12  KI2512    경기평촌대리점  강백호  4320000  2312000     3     240
13  KI2671  제주서귀포시대리점  주은명  4040000  4760000     4      50
14  KI2776   경기남양주대리점  김수진  8160000  4352000     2     354
15  KI2870   경기구리시대리점  박진형  6000000  3400000     2     143
16  KI2910    강원춘천대리점  김은향  4800000  4896000     1     176
17  KI3030    강원영동대리점  전수창  4560000  3128000     2      98
18  KI3131    경기하남대리점  김민정  2750000  7268000     3     293
19  KI3252    강원포천대리점  서가은  2420000  4740000     4     240

# DataFrame 조회

### friend_df

In [32]:
#  Nate와 Jenny 만 추출하고 싶다면?

friend_df[1:3]

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [30]:
# name 컬럼만 보고 싶다면?

print(friend_df["name"])

friend_df.name

0     John
1     Nate
2    Jenny
Name: name, dtype: object

0     John
1     Nate
2    Jenny
Name: name, dtype: object

In [10]:
# age 컬럼만 보고 싶다면?

print(df["age"])

df.age

0    25
1    30
2    30
Name: age, dtype: int64

0    25
1    30
2    30
Name: age, dtype: int64

#### loc와 iloc 사용해서 조회하기

* <b>loc : location(행,열 모두 이름 사용)</b>

In [27]:
df.loc?

In [33]:
#  Nate와 Jenny 만 추출하고 싶다면?

# loc 는 라벨로 무조건 사용해야 함
# 행, 열 개념으로 오는 것이기 때문에 행이 2개가 오려면 반드시 list 사용하기

friend_df.loc[[1,2]]

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [38]:
# 범위로 줄때는 : 사용 가능, 단, 이때는 [] 안에 넣는 게 아님
# 마지막 범위의 숫자를 포함해서 결과를 보여줌

# John, Nate 만 보고 싶다면?

friend_df.loc[0:1]

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [40]:
# 0,2번 행을 대상으로 name, job 컬럼만 가져오기

friend_df.loc[[0,2],["name","job"]]

    name        job
0   John    student
2  Jenny  developer

* <b>iloc : index location(행,열 모두 index 사용)</b>

In [42]:
# 0번 행의 정보 가져올 때

friend_df.iloc[0]

name       John
age          25
job     student
Name: 0, dtype: object

In [43]:
# iloc[] 1번 행의 0번 칼럼의 값

friend_df.iloc[1,0]

'Nate'

In [44]:
friend_df.iloc[0,1]

25

In [47]:
# 0번행과 1번행 가져오기

friend_df.iloc[0:2] # friend_df.iloc[[0,1]]

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [48]:
# 0번행과 1번행의 name 만 가져오기

friend_df.iloc[0:2,0]

0    John
1    Nate
Name: name, dtype: object

In [49]:
# 0번행과 1번행의 name,age 만 가져오기

friend_df.iloc[0:2,[0,1]]

   name  age
0  John   25
1  Nate   30

### student_df

In [57]:
# 2번 행 가져오기

# student_df[0] 는 에러남 - 0번만 가지고 오고 싶다고 지정할 수 없음

student_df[2:3]

   국어  영어  수학
2  35  65  95

In [58]:
# 2번 행 가져오기

student_df.loc[2]

국어    35
영어    65
수학    95
Name: 2, dtype: int64

In [59]:
# 1번 행의 수학 점수 가져오기

student_df.loc[1,"수학"]  # student_df.iloc[1,2]

85

In [51]:
# "국어" 컬럼 가져오기

student_df["국어"]

0    15
1    25
2    35
Name: 국어, dtype: int64

### month_df

In [63]:
# 2월 행 가져오기

month_df.loc["2월"]

국어    25
영어    55
수학    85
Name: 2월, dtype: int64

In [66]:
# 2월 행 가져오기

month_df.iloc[1]

국어    25
영어    55
수학    85
Name: 2월, dtype: int64

In [64]:
# 영어 컬럼만 가져오기

month_df["영어"]

1월    45
2월    55
3월    65
Name: 영어, dtype: int64

In [69]:
# 2~3월 행 가져오기

month_df.iloc[1:3]

    국어  영어  수학
2월  25  55  85
3월  35  65  95

In [70]:
# 2~3월 행 가져오기

month_df.loc["2월":"3월"]

    국어  영어  수학
2월  25  55  85
3월  35  65  95

### two_df

In [72]:
# 첫번째 행 가져오기

print(two_df.loc['내용1'])

# iloc[] : 인덱스 값이 오거나(단, 인덱스는 정수값이어야 함), 컬럼 인덱스가 와야 함
# df.iloc["내용1"] => 쓸 수 없음

two_df.loc['내용1','c1':'c5']  # 여기서 앞은 인덱스명, 뒤는 컬럼명

c1    1
c2    2
c3    3
c4    4
c5    5
Name: 내용1, dtype: int64

c1    1
c2    2
c3    3
c4    4
c5    5
Name: 내용1, dtype: int64

In [73]:
# 두번째 컬럼 가져오기

print(two_df["c2"])

two_df.c2

내용1    2
내용2    7
Name: c2, dtype: int64

내용1    2
내용2    7
Name: c2, dtype: int64

In [74]:
two_df.iloc[0,2]

3

### column condition

* friend_age 에 비교 연산자를 사용하면 아래처럼 결과를 보여줌
* 따라서 그걸 이용해서 [] 안에 넣어주면 subset을 추출할 수 있음

In [83]:
friend_df.age > 25

0    False
1     True
2     True
Name: age, dtype: bool

In [76]:
# 나이가 25살보다 많은 사람 추출

friend_df[friend_df.age > 25]

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [136]:
# 나이가 25살보다 많고, 이름이 Nate인 사람 추출

friend_df[(friend_df.age > 25) & (friend_df.name == 'Nate')]

   name  age      job
1  Nate   30  teacher

In [77]:
# 위와 동일한 작업인데 query 메소드 사용

friend_df.query("age>25")

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [141]:
# 나이가 25살보다 많고, 이름이 Nate인 사람 추출

friend_df.query("age > 25" and "name == 'Nate'")

   name  age      job
1  Nate   30  teacher

In [85]:
# 이름이 jenny인 행 추출

friend_df[friend_df['name'] == "Jenny"]

    name  age        job
2  Jenny   30  developer

In [82]:
# 국어 점수가 20 이상인 행만 추출

student_df[student_df['국어'] >= 20]

   국어  영어  수학
1  25  55  85
2  35  65  95

In [84]:
student_df.query("국어>=20")

   국어  영어  수학
1  25  55  85
2  35  65  95

# DataFrame 삭제

* 수정과 삭제는 해당 dataframe에 적용을 하지 않으면 반영 안됨
* 직접 반영을 위해 inplace=True 사용/ df에 직접 변경을 원하지 않으면 새로운 변수에 담아서 사용하기

In [94]:
# 0,2번 행 삭제 => 결과는 삭제하고 남은 행

friend_df.drop([0,2])

   name  age      job
1  Nate   30  teacher

In [95]:
# 실제는 삭제된 게 아님

friend_df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [90]:
friend_df.drop?

In [96]:
# 바로 반영을 하기 위해서는 

friend_df.drop([0,2], inplace=True)

In [98]:
# inplace를 쓰고 난 후

friend_df

   name  age      job
1  Nate   30  teacher

In [124]:
friend_dict_list = [
    {
        "name": "John",
        "age": 25,
        "job": "student",
    },
    {
        "name": "Nate",
        "age": 30,
        "job": "teacher",
    },
    {
        "name": "Jenny",
        "age": 30,
        "job": "developer",
    },
]

friend_df = pd.DataFrame(friend_dict_list)
friend_df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [103]:
friend_df.drop?

In [105]:
# age가 25일 행만 df에 남길 원한다면?

friend_df = friend_df[friend_df.age == 25]

In [106]:
friend_df

   name  age      job
0  John   25  student

In [112]:
# 특정 컬럼 삭제하기
# axis 없는 경우 에러남 : age가 컬럼명인지 인덱스 명인지 알 수 없음

friend_df.drop("age", axis = 1)

    name        job
0   John    student
1   Nate    teacher
2  Jenny  developer

In [113]:
# 만일 위의 방법이 싫다면?

friend_df.drop(columns = "age")

    name        job
0   John    student
1   Nate    teacher
2  Jenny  developer

# DataFrame 수정

In [115]:
# 컬럼명 수정

friend_df.columns = ["이름","나이","직업"]
friend_df

      이름  나이         직업
0   John  25    student
1   Nate  30    teacher
2  Jenny  30  developer

In [116]:
# 인덱스 수정

friend_df.index = ["p1","p2","p3"]
friend_df

       이름  나이         직업
p1   John  25    student
p2   Nate  30    teacher
p3  Jenny  30  developer

In [125]:
# 특정 값 수정 - nate 이름 변경하기

friend_df.iloc[1,0] = "Torres"
friend_df

     name  age        job
0    John   25    student
1  Torres   30    teacher
2   Jenny   30  developer

In [133]:
# 특정 행 추가

friend_df.loc[3] = ["Mike",30,"student"]
friend_df

     name  age        job
0    John   25    student
1  Torres   30    teacher
2   Jenny   30  developer
3    Mike   30    student